# SelectionColor Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ColorOptions..::..SelectionColor Property
ColorOptions Class See Also
---
The color used to highlight selected elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public Color SelectionColor { get; set; }
```

Visual Basic
---
```text
Public Property SelectionColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ SelectionColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ColorOptions Class
Autodesk.Revit.DB Namespace